Revit 2027 API
View3D.CanToggleBetweenPerspectiveAndIsometric Method
 Checks whether this view can toggle between perspective and isometric.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanToggleBetweenPerspectiveAndIsometric()
Public Function CanToggleBetweenPerspectiveAndIsometric As Boolean
public:
bool CanToggleBetweenPerspectiveAndIsometric()
member CanToggleBetweenPerspectiveAndIsometric : unit -> bool
Return Value
Boolean
 True if this view can be toggled, false otherwise.
Remarks
 This view can only be toggled if no view specific elements are contained.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace